{
  "projects": [
    {
      "title" : "Review Republic",
      "description" : "리뷰리퍼블릭은 3세대 커뮤니티를 표방하는 리뷰 기반의 커뮤니티 서비스입니다. 서비스 운영 및 신규 서비스 제작 업무를 맡았습니다. Version Control은 Git과 Github를 사용했으며, Scheduler는 Trello, 협업도구는 Slack을 사용했습니다. Meteor를 사용하고 있으며, React를 프론트엔드 프레임워크로 사용하고 있습니다. Redux-thunk를 사용하고 있으며, 라우터는 meteor 지원을 사용중입니다. 인프라는 AWS S3, CloudFlare, Digital Ocean (Server 4, DB 2, NGINX lb Server 1, ElasticSearch 1, Cron Server 1, Staging Server 1, Jenkins Server 1), Redis를 사용중이며, DB는 MongoDB, mLab 데브옵스는 Jenkins, Docker 사용했습니다.",
      "part" : "Front-end / Back-end Programming",
      "status" : "Launching",
      "feature" : "Meteor.js, React.js, Mongo DB 등..."
    },
    {
      "title" : "Taekwon VR",
      "description" : "태권도를 가상현실에서 시뮬레이팅 할 수 있는 태권VR은 Vive VR과 Perception Neuron을 사용한 몸 인식을 통해 VR 환경에서 매끄럽게 동작하도록 되었습니다. 원래는 Perception Neuron이 아닌 센서를 구매하여 사용하였으나 오차 범위와 환경변수등의 까다로운 애로사항이 있어 perception newron으로 교체하게 되었습니다. 또한 Unity에서의 얼라이어싱 현상이 너무 심해서 해당 현상을 고치는데 시간이 많이 들었습니다.",
      "part" : "Client Programming",
      "status" : "Closed",
      "feature" : "Unity3D, Vive VR, Perception Neuron"
    },
    {
      "title" : "Pandaria Dash",
      "description" : "판다리아 대쉬는 러닝 게임으로써, 매력적인 판다 캐릭터와 더불어 장애물을 피하고 코인을 모으는 게임입니다. 이 게임은 중국 런칭이 목적이라서 안드로이드 갤럭시 s2기준으로 제작하였으며, 최적화에 신경을 상당부분 썻습니다. 특히나 Terrain이 퍼포먼스가 제대로 안나와서 Model을 fbx에서 만들어서 맥스에서 bake가 제대로 안되므로 Unity로 옮겨와서 light를 bake했습니다. 그러한 과정을 거쳐서 셰이더를 적용하고 그럴듯한 게임으로 만들었습니다. 또한 필드 모델들의 폴리곤 최적화 및 원할한 구동을 위해 메모리 최적화를 신경을 많이 썻습니다.",
      "part" : "Client Programming",
      "status" : "Closed",
      "feature" : "Unity3D"
    },
    {
      "title" : "Tile road",
      "description" : "타일로드는 꼬리와 머리가 각각 클리어 존에 닿도록 해결하는 퍼즐게임 입니다. 맵이 몇백개가 있으며 이 맵들을 클리어 하는데, 별 3개를 따도록 노력해야 합니다. 이 게임에서 맵툴, 인게임 요소를 제작했으며 iOS, AOS 동시 런칭을 하였습니다. 또한 광고 모듈을 5가지 이상 붙였습니다. AdColony, Vungle, Google Play Games, Unity Ads, Google Ads, EveryDay, 등등.. 문제없이 빌드되도록 구현했으며, iOS의 경우 프레임워크가 제대로 동작하지 않는 문제가 있어서 소스코드를 만들어서 해결해주었습니다.",
      "part" : "Client Programming",
      "status" : "Launching",
      "feature" : "Unity3D, AndroidStudio, XCode"
    },
    {
      "title" : "TapBrick",
      "description" : "탭브릭은 장애물을 피하면서 가장 위로 올라가는 점수를 내기하는 게임입니다. 광고 모듈을 5가지 이상 붙였습니다. AdColony, Vungle, Google Play Games, Unity Ads, Google Ads, EveryDay, 등등.. 문제없이 빌드되도록 구현했으며, iOS의 경우 프레임워크가 제대로 동작하지 않는 문제가 있어서 소스코드를 만들어서 해결해주었습니다.",
      "part" : "Client Programming",
      "status" : "Launching",
      "feature" : "Unity3D, AndroidStudio, XCode"
    },
    {
      "title" : "4D Gunslinger",
      "description" : "4D 건슬링거는 승마 헬스 기계를 탑승하여 말의 속도와, 총을 들고 여러가지 아이템을 부수고 업그레이드를 통해 게임을 풀어나가야 합니다. 아두이노를 통해 승마 기계와의 시리얼 포트 통신을 해서 신호를 조작했습니다. 총 센서는 적외선 통신을 통해서 값을 받아오는 것을 마우스 이벤트로 처리했습니다.",
      "part" : "Client Programming",
      "status" : "Launching",
      "feature" : "Unity3D, Arduino, 3D Health Horse machine"
    },
    {
      "title" : "Pandaria Puzzle",
      "description" : "판다리아 퍼즐은 적이 끝까지 가지 못하도록 막는 디펜스 게임입니다. 페이스북 연동 및 여러가지 활용을 위해 PRIME31이라는 플러그인을 썻으며 구글 인앱 결제, 애플 인앱 결제를 구현했습니다. 모바일 게임 초창기 작품이라 프레임 드랍을 막기위해 최적화를 공들였습니다. UI 애니메이션 및 서포트를 담당했습니다. 특이사항 으로는 IOS 영국 스토어 9위까지 올라갔습니다.",
      "part" : "Client Programming",
      "status" : "Launching",
      "feature" : "Unity3D, AndroidStudio, XCode"
    },
    {
      "title" : "4D BIGWAR",
      "description" : "4D 빅워는 거대한 4D 체감형 머신을 탑승하고 그 위에서 조작을 통해서 발칸을 발사하여 게임을 진행합니다. 체험형 게임이며 발칸을 발사하면서 적의 기지를 부수고 직접 움직여서 최종 목적지 까지 이동하면 성공입니다.",
      "part" : "Client Programming",
      "status" : "Launching",
      "feature" : "Unity3D, Arduino, 3D Motion Device"
    },
    {
      "title" : "BMS Reader",
      "description" : "리듬게임을 좋아하고 즐기다가 리듬게임에도 공통 규격이 있는 것을 보고, 해당 규격을 제대로 읽어들여서 게임을 즐길 수 있게 리더기를 만들어 보았습니다. 해당 소스코드는 깃헙에도 공유되어 있고, 블로그에 구현 정보와 설명을 써놓았습니다. 수많은 사람들이 방문하여 정보를 얻어갔습니다.",
      "part" : "Client Programming",
      "status" : "Closed",
      "feature" : "Cocos2d-x, FMOD Sound Library, AndroidStudio"
    },
    {
      "title" : "Crazy Beat",
      "description" : "고등학교 2학년때 제작한 크레이지 비트는 기존에 없던 튕기는 방식의 리듬 게임 입니다. 박자에 맞춰서 해당 색으로 튕기면 되는 간단한 게임입니다. 음원등 여러가지의 문제가 있어서 스토어에는 올라가지 못했습니다. 당시 코코스2D를 사용했는데 Cygwin이라는 리눅스 터미널에서 크로스플랫폼 빌드를 해서 빌드하는등 여러가지 난재가 있었으나 결국에 해결하여 빌드를 성공했습니다.",
      "part" : "Client Programming",
      "status" : "Closed",
      "feature" : "Cocos2d-x, FMOD Sound Library, AndroidStudio"
    }
  ]
}